/* An error occurred when creating a new album. Please check your internet connection and try again later. */
"An error occurred when creating a new album. Please check your internet connection and try again later." = "An error occurred when creating a new album. Please check your internet connection and try again later.";

/* An error occurred when uploading an image to Picasa Web Albums. Please check your internet connection and try again later. */
"An error occurred when uploading an image to Picasa Web Albums. Please check your internet connection and try again later." = "An error occurred when uploading an image to Picasa Web Albums. Please check your internet connection and try again later.";

/* Could not create a new album */
"Could not create a new album" = "Could not create a new album";

/* Could not upload an image */
"Could not upload an image" = "Could not upload an image";

